In [1]:
import pandas as pd
import pyodbc
import numpy as np

In [2]:
import sqlCredentials as sql

In [3]:
proc_db = pyodbc.connect(
    'DRIVER={ODBC Driver 17 for SQL Server};'
    'Server=52.86.56.66;'
    'Database=PROCUREMENTDB;'
    'UID='+sql.username+';'
    'PWD='+sql.password+';'
    'Trusted_connection=no;'
)

In [4]:
pub_dict = """
SELECT *
FROM dbo.PublisherDictionary
"""

In [5]:
df = pd.read_sql(pub_dict,proc_db)

In [6]:
df.head()

,PublisherLong,PublisherShort
0,"""Abrams, Inc.""",ABRAMS
1,"""Addison-Wesley Longman, Incorporated""",PEARSON
2,"""Addison-Wesley Longman, Limited""",PEARSON
3,"""Allyn & Bacon, Incorporated""",PEARSON
4,"""American Occupational Therapy Association, In...","American Occupational Therapy Association, Inc..."

In [7]:
df.dtypes

PublisherLong     object
PublisherShort    object
dtype: object

In [8]:
megalist = """
SELECT *
FROM Process.SupplierMegaList
"""

In [9]:
megalist = pd.read_sql(megalist,proc_db)

In [10]:
megalist.head()

,ISBN,Supplier,ListName,Publisher,Currency,ListPrice,Discount,CostUnitPrice,OrderPercentFee,FlatRateFee,...,MaxCostPerOrder,MinCostPerOrder,ShipmentOrigin,Recurrency,Stockqty,UnitShippingCost,ExpirationDate,TotalUnitCost,Comment,Timestamp
0,9780262530873,BILLSON,pubs_matrix,UNIVERSITY PRESS,GBP,4.99,0.38,3.09,0.03,0.0,...,0.0,0.0,UK,weekly,3,3.47,2020-03-06,7.43,None,2020-04-29 12:00:00.800
1,9780262530989,BILLSON,pubs_matrix,UNIVERSITY PRESS,GBP,25.00,0.38,15.50,0.03,0.0,...,0.0,0.0,UK,weekly,3,3.47,2020-03-06,23.33,None,2020-04-29 12:00:00.800
2,9781760110185,ZOOKAL,Zookal Supplylist 3-23-2020,ALIEN & UNWIN,AUD,0.00,0.00,13.00,0.00,0.0,...,0.0,0.0,AUS,1 time,150,3.30,2020-09-19,11.88,None,2020-04-29 12:00:00.800
3,9780262531092,BILLSON,pubs_matrix,UNIVERSITY PRESS,GBP,37.95,0.38,23.53,0.03,0.0,...,0.0,0.0,UK,weekly,3,3.47,2020-03-06,33.62,None,2020-04-29 12:00:00.800
4,9780262531238,BILLSON,pubs_matrix,UNIVERSITY PRESS,GBP,28.00,0.38,17.36,0.03,0.0,...,0.0,0.0,UK,weekly,3,3.47,2020-03-06,25.71,None,2020-04-29 12:00:00.800

In [11]:
megalist.dtypes

ISBN                        object
Supplier                    object
ListName                    object
Publisher                   object
Currency                    object
ListPrice                  float64
Discount                   float64
CostUnitPrice              float64
OrderPercentFee            float64
FlatRateFee                float64
LeadTimeWeeks               object
MaxQtyPerOrder               int64
MinQtyPerOrder               int64
MaxCostPerOrder            float64
MinCostPerOrder            float64
ShipmentOrigin              object
Recurrency                  object
Stockqty                     int64
UnitShippingCost           float64
ExpirationDate      datetime64[ns]
TotalUnitCost              float64
Comment                     object
Timestamp           datetime64[ns]
dtype: object

In [12]:
megalist.columns

Index(['ISBN', 'Supplier', 'ListName', 'Publisher', 'Currency', 'ListPrice',
       'Discount', 'CostUnitPrice', 'OrderPercentFee', 'FlatRateFee',
       'LeadTimeWeeks', 'MaxQtyPerOrder', 'MinQtyPerOrder', 'MaxCostPerOrder',
       'MinCostPerOrder', 'ShipmentOrigin', 'Recurrency', 'Stockqty',
       'UnitShippingCost', 'ExpirationDate', 'TotalUnitCost', 'Comment',
       'Timestamp'],
      dtype='object')

In [13]:
sup_list = megalist[['ISBN', 'Supplier', 'Publisher', 'Currency','ListPrice','Discount','CostUnitPrice', 'UnitShippingCost', 'MaxQtyPerOrder']]

In [14]:
sup_list.head()

,ISBN,Supplier,Publisher,Currency,ListPrice,Discount,CostUnitPrice,UnitShippingCost,MaxQtyPerOrder
0,9780262530873,BILLSON,UNIVERSITY PRESS,GBP,4.99,0.38,3.09,3.47,1000
1,9780262530989,BILLSON,UNIVERSITY PRESS,GBP,25.00,0.38,15.50,3.47,1000
2,9781760110185,ZOOKAL,ALIEN & UNWIN,AUD,0.00,0.00,13.00,3.30,150
3,9780262531092,BILLSON,UNIVERSITY PRESS,GBP,37.95,0.38,23.53,3.47,1000
4,9780262531238,BILLSON,UNIVERSITY PRESS,GBP,28.00,0.38,17.36,3.47,1000

In [15]:
sup_list['price'] = np.where(sup_list['ListPrice'] == 0.00, sup_list['CostUnitPrice'], sup_list['ListPrice'])

In [16]:
sup_list.head()

,ISBN,Supplier,Publisher,Currency,ListPrice,Discount,CostUnitPrice,UnitShippingCost,MaxQtyPerOrder,price
0,9780262530873,BILLSON,UNIVERSITY PRESS,GBP,4.99,0.38,3.09,3.47,1000,4.99
1,9780262530989,BILLSON,UNIVERSITY PRESS,GBP,25.00,0.38,15.50,3.47,1000,25.00
2,9781760110185,ZOOKAL,ALIEN & UNWIN,AUD,0.00,0.00,13.00,3.30,150,13.00
3,9780262531092,BILLSON,UNIVERSITY PRESS,GBP,37.95,0.38,23.53,3.47,1000,37.95
4,9780262531238,BILLSON,UNIVERSITY PRESS,GBP,28.00,0.38,17.36,3.47,1000,28.00

In [17]:
sup_list.drop(columns = ['ListPrice', 'CostUnitPrice'], inplace = True)

In [18]:
sup_list

,ISBN,Supplier,Publisher,Currency,Discount,UnitShippingCost,MaxQtyPerOrder,price
0,9780262530873,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,4.99
1,9780262530989,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,25.00
2,9781760110185,ZOOKAL,ALIEN & UNWIN,AUD,0.00,3.30,150,13.00
3,9780262531092,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,37.95
4,9780262531238,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,28.00
...,...,...,...,...,...,...,...,...
3390617,9781936140589,ALEK,Charlesbridge,USD,0.66,0.50,100,7.95
3390618,9781936140596,ALEK,Charlesbridge,USD,0.66,0.50,100,7.95
3390619,9781936140619,ALEK,Charlesbridge,USD,0.66,0.50,100,12.95
3390620,9781936140664,ALEK,Charlesbridge,USD,0.66,0.50,100,12.99
3390621,9781936140695,ALEK,Charlesbridge,USD,0.66,0.50,100,12.95

In [19]:
sup_list['Supplier'].unique()

array(['BILLSON', 'ZOOKAL', 'Bertrams', 'ALEK', 'ALEK ', 'Felipe',
       'Probook', 'ARMANDO', 'Billson', 'UT', 'Laurentiu', 'ABE', 'SENAD',
       'Alek', 'Friday', 'BRYAN', 'RAJAN', 'LAURENTIU', 'SOHRAB', 'Apex',
       'laurentiu', 'APEX', 'PROBOOK', 'Sohrab', 'Billson T', 'MYAMMAR',
       'Bryan', 'Textbook Trade HK', 'Billson - T', 'GAUTAM', 'Armando',
       'probook', 'Billson - SCI'], dtype=object)

In [20]:
def clean_up(phrase):
    phrase = phrase.lstrip()
    phrase = phrase.rstrip()
    phrase = phrase.upper()
    return phrase

In [21]:
str_columns = ['ISBN', 'Supplier', 'Publisher', 'Currency']

for col in str_columns:
    sup_list[col] = sup_list.apply(lambda x: clean_up(x[col]), axis =1)
    
sup_list['Supplier'].unique()

array(['BILLSON', 'ZOOKAL', 'BERTRAMS', 'ALEK', 'FELIPE', 'PROBOOK',
       'ARMANDO', 'UT', 'LAURENTIU', 'ABE', 'SENAD', 'FRIDAY', 'BRYAN',
       'RAJAN', 'SOHRAB', 'APEX', 'BILLSON T', 'MYAMMAR',
       'TEXTBOOK TRADE HK', 'BILLSON - T', 'GAUTAM', 'BILLSON - SCI'],
      dtype=object)

In [22]:
for col in str_columns:
    print(sup_list[col].unique())

['9780262530873' '9780262530989' '9781760110185' ... '9781936140350'
 '9781936140367' '9781936140411']
['BILLSON' 'ZOOKAL' 'BERTRAMS' 'ALEK' 'FELIPE' 'PROBOOK' 'ARMANDO' 'UT'
 'LAURENTIU' 'ABE' 'SENAD' 'FRIDAY' 'BRYAN' 'RAJAN' 'SOHRAB' 'APEX'
 'BILLSON T' 'MYAMMAR' 'TEXTBOOK TRADE HK' 'BILLSON - T' 'GAUTAM'
 'BILLSON - SCI']
['UNIVERSITY PRESS' 'ALIEN & UNWIN' 'BLOOMSBURY' ... 'BLOODAXE BOOKS'
 'BLOODAXE BOOKS LTD' 'BOOKS ON TAPE']
['GBP' 'AUD' 'USD' 'CAD' 'EUR' 'SGD' 'TWD' 'CNY']

In [23]:
# We have too many Publihser's name, we have to merge with the dictionary,
#Left Join would do the work
df.head()

,PublisherLong,PublisherShort
0,"""Abrams, Inc.""",ABRAMS
1,"""Addison-Wesley Longman, Incorporated""",PEARSON
2,"""Addison-Wesley Longman, Limited""",PEARSON
3,"""Allyn & Bacon, Incorporated""",PEARSON
4,"""American Occupational Therapy Association, In...","American Occupational Therapy Association, Inc..."

In [24]:
for col in list(df.columns):
    df[col] = df.apply(lambda x: clean_up(x[col]), axis =1)

In [25]:
df['PublisherShort'].unique()

array(['ABRAMS', 'PEARSON',
       'AMERICAN OCCUPATIONAL THERAPY ASSOCIATION, INCORPORATED',
       'ARCHIVE EDITIONS, LIMITED', 'AVIAT INC', 'BERRETT-KOEHLER',
       'FINANCIAL TIMES BUSINESS ENTERPRISES, LIMITED', 'WILEY', 'MCGRAW',
       'PIONEER DRAMA', 'MURACH', "O'REILLY", 'PLURAL PUBLISHING INC',
       'SCITECH PUBLISHING, INCORPORATED', 'SITEPOINT PTY, LIMITED',
       'SLACK', 'TIMBER PRESS',
       'DIFUSION CENTRO DE PUBLICACION Y PUBLICACIONES DE IDIOMAS, S.L.',
       'GAZELLE BOOK SERVICES', 'GROVE/ATLANTIC, INCORPORATED',
       'JAMES LORIMER & COMPANY LTD., PUBLISHERS', 'HACHETTE LIVE',
       'MASCOT BOOKS, INCORPORATED', 'TALONBOOKS, LIMITED',
       'A&C BLACK POD', 'AA WORLD', 'ABC CLIO', 'ABINGDON',
       'ADAMS MEDIA CORPORATION', 'AFRICAN & CARIBBEAN WRITERS', 'ALA',
       'ALEK', 'ALFRED MUSIC', 'ALLWORTH', 'AMA', 'AMER PSYCH ASS.',
       'AMAZON.COM', 'AMERICAN MATHEMATICAL SOCIETY', 'ANDREWS MCMEEL HB',
       'ANDREWS MCMEEL PB', 'ANGLO AMERICAN BOOK CO LTD', 'ANTHEM PR',
       'AOCS PUBLISHING', 'AOTA', 'APERTURE', 'APPLAUSE',
       'APPLE ACADEMIC PRESS', 'ARMAND COLIN', 'ARSENAL PULP PRESS',
       'SCHOLASTIC', 'ASA', 'ASTD', 'SIMON & SCHUSTER', 'AVIVA PUB',
       'BAKER', 'BALLANTINE BOOKS', 'BALZER + BRAY', 'BARCELONA',
       'BARRONS', 'RANDOM HOUSE', 'BERGAHN', 'BERKLEE PR', 'BERKLEY',
       'BF UK LTD', 'BIRKBECK LAW PRESS', 'BLOOMSBURY', 'BOOKERY',
       'BOOKS INTERNATIONAL- INC.', 'BOOKWIRE', 'BOOSEY', 'BRAZOS PRESS',
       'BRIDGEPNT', 'BRIGHT RED PUBLISHING LTD',
       'BRITISH COMPUTER SOCIETY', 'BROADMAN', 'BROADVIEW',
       'BROADWAY BOOKS', 'BROOKINGS', 'BROWN BEAR PRESS',
       'BRUNSWICK BOOKS', 'C HURST & CO (PUBLISHERS)LTD',
       'CALIFORNIA UNIVERSITY PRESS', 'CAMBRIDGE', 'CANTERBURY CLASSICS',
       'CAPTUS PR', 'CENGAGE', 'CENTRAL BOOKS', 'CHELSEA G',
       'CHICAGO UNIVERSITY PRESS', 'CHRONICLE', 'CLE INTL',
       'CLEARWAY PHASE 0', 'COACH HSE', 'HARPER COLLINS', 'T&F',
       'CREATIONS LOISIRS ENSEIGNEMENT INTERNATIONAL',
       'CRITICAL PUBLISHING', 'CSLI', 'CUP ELT', 'DARK HORSE',
       'DARK HORSE BOOKS', 'DARK HORSE MANGA', 'DAVID FULTON PUBLISHERS',
       'DC COMICS', 'DEDALUS BOOKS LIMITED', 'DEEP BOOKS', 'DEL REY',
       'DELL',
       'DIFUSION CENTRO DE INVESTIGACION Y PUBLICACIONES DE IDIOMAS S.L.',
       'DIO PRESS INC', 'DIOGENES', 'DOUBLEDAY', 'DOUGLAS & MCINTYRE',
       'DUNDURN', 'EARTHSCAN', 'ECCO', 'EDITION SYNAPSE',
       'EDITIONS NOVALIS', 'EDITIONS PIERRE TISSEYRE',
       'EDMOND PUBLISHING', 'EERDMANS', 'ELEPHANT ROOM PRESS', 'ELSEVIER',
       'EMERALD', 'EMOND MONT', 'EPFL PRESS', 'ESI INTERNATIONAL', 'ESRI',
       'ESTATES GAZETTE', 'EUROSPAN', 'EYE ON EDUCATION', 'FEDERATION',
       'FISCHER', 'FITNESS INFO TECH', 'FITZHENRY', 'FOCAL PR',
       'FOOTPRINT', 'GALLAUDET', 'GALLERY/SCOUT PRESS', 'GALLUP PRESS',
       'GESTALT PRESS', 'MACMILLAN', 'GINN & CO', 'GMC DISTRIBUTION',
       'GOWER', 'GRAND CENTRAL LIFE & STYLE',
       'GREENWICH MEDICAL MEDIA LIMITED', 'GROUNDWOOD BOOKS',
       'HAKLUYT SOCIETY', 'HARP', 'HARP SANFR', 'HAYMARKET BOOKS',
       'HEINEMANN', 'HERALD PRESS', 'HIMSS PUBLISHING', 'HIPPOCRENE',
       'HOLCOMB+H', 'HUMAN KINETICS', 'I B TAURIS ACADEMIC',
       'IHS BRE PRESS', 'IIBA', 'INDUSTRIAL PRESS', 'INFO AGE', 'INGRAM',
       'INST AUDIT', 'INTERNATIONAL WORK GROUP FOR INDIGENOUS AFFAIRS',
       'INTERVARS', 'INTERWEAVE', 'INTL RDG', 'IRWIN LAW', 'ISTE',
       'J KNOX', 'JAPAN TIME', 'JASON ARONSON INC', 'JAYPEE MEDICAL',
       'JENNY STANFORD PUBLISHING', 'JESSICA KINGSLEY',
       'JOHN WILEY & SONS LIMITED', 'J&B', 'K/H', 'KAPLAN PUBLISHING',
       'KATHERINE TEGEN BOOKS', 'KEGAN PAUL', 'KRIEGER', 'KUPERARD',
       'LETTS EDUCATIONAL', 'ROWMAN & LITTLEFIELD',
       'LIDEL EDICOES TECNICAS LDA', 'LIGHTNING SOURCE UK LTD',
       'LIMELIGHT', 'LYNNE RIENNER', 'M WIESE', 'MACAT LIBRARY',
       'MARSTON BOOK SERVICES LTD', 'MATERIALS RESEARCH SOCIETY',
       'MCCLELLAND & STEWART', 'MELIA PUBLISHING SERVICES LTD',
       'MEREDITH M', 'METONYMY', 'MGM', 'MLA',
       'MOTILAL UK BOOKS OF INDIA', 'MUSIC SALES CORPORATION',
       'N HARBINGR', 'N SCHUMAN', 'N/A', 'NAEYC',
       'NATIONAL ACADEMIES PRESS', 'NAVAL INST', 'NBS', 'OXFORD',
       'NETHERLANDS INSTITUTE FOR SOCIAL RESEARCH',
       'NEW DIRECTIONS PUBLISHING CORPORATION', 'NEW RIDERS PUBLISHING',
       'NEW SOC', 'NON BASIC STOCK LINE', 'NONE', 'NORTHLIGHT', 'NSB',
       'OLIVIA', 'ONE WORLD', 'ORBIS BK', 'OXFORD UP ELT', 'PADEMELON',
       'PAUL LIMA PRESENTS', 'PAULIST', 'PAULIST PRESS', 'PEARSON ELT',
       'PENGUIN RANDOM HOUSE USA', 'PERENNIAL', 'PERIBO',
       'PHARMACEUTICAL PRESS', "PING-CHENG T'UNG", 'PITMAN PUBLISHING',
       'PLAYWRIGHTS CANADA PRESS', 'PLENUM PUB CORP', 'PLUTO PRESS (POD)',
       'PM PRESS', 'PRACTICAL PRE-SCHOOL BOOKS', 'PRIM ED', 'PRINCE BK',
       'PRINTERS ROW', 'PROJ MGMT', 'PSCYHOLOGY PRESS',
       'PUBLISHERS GROUP UK', 'PUDDLEDANCER PRESS', 'PYRCZAK',
       'R RINEHART', 'RAINTREE EDUCATIONAL', 'RED HEN PRESS',
       'REDLEAF PR', 'REED', 'RFF PRESS', 'RIBA PUBLISHING',
       'ROARING BROOK PRESS', 'ROBERTS & CO',
       'ROBERTS & COMPANY PUBLISHERS',
       'ROYAL COLLEGE OF OBSTETRICIANS & GYNAECOLOGISTS PRESS',
       'ROYAL SOCIETY OF CHEMISTRY', 'RYERSON', 'SAGE',
       'SAQI BOOKS PUBLISHERS', 'SCARECROW PRESS INC', 'SCHWALBE',
       'SCION PUBLISHING LTD', 'SHARPE', 'SHER MUSIC',
       'SIGS BOOKS & MULTIMEDIA', 'SILMAN-JAM', 'SME',
       'SOCIETY FOR INDUSTRIAL AND APPLIED MATHEMATICS',
       'SPECIAL SALES PROMOTION', 'SPON PRESS', 'SPRINGER', 'SQUARE FISH',
       'STATA PRESS', 'STENHOUSE', 'STEP PUB', 'STUDYMATES', 'STYLUS PUB',
       'SWALLOW', 'SWEDISH PHARMACEUTICAL PRESS', 'SWEET & MAXWELL',
       'TARCHERPERIGEE', 'TAUNTON PR', 'TCP', 'THIEME', 'TITAN',
       'TITAN BOOKS', 'TORONTO UNIVERSITY PRESS', 'TRANSCRIPT',
       'TRIGGER PRESS', 'TURNAROUND', 'UNITED', 'UNIVERSITY PRESS',
       'UNKNOWN - MIGRATION', 'USBORNE', 'VERSO EDITIONS', 'VERTIGO',
       'VIZ MEDIA', 'VIZ MEDIA LLC', 'WEST-KNOX', 'WESTMINSTR',
       'WESTVIEW', 'WEXFORD COLLEGE PRESS', 'WHOLE PERS',
       'WISEFOOL PRESS', 'WIZARDS OF THE COAST', 'W KLUWER',
       'W KLUWER LAW', 'W KLUWER HEALTH', 'WORKMAN',
       'WORLD TRADE ORGANIZATION', 'WRITING BY CHOICE', '3D TOTAL', 'AAP',
       'AIAA', 'ALIEN & UNWIN', 'ASHGATE', 'ASHP', 'ATP', 'BASIC BOOKS',
       'BLC UP', 'BROOKES', 'CABI', 'HOUGHTON MIFFLIN', 'COLUMBIA UP',
       'EDWARD ELGAR', 'FA DAVIS', 'FOCUS PUBLISHING', 'GEORGETOWN UP',
       'GOODHEART-WILLCOX', 'GUILFORD', 'HEALTH PROFFESIONALS', 'HEINLE',
       'HOLT MCDOUGAL', 'J ROSS', 'JOHN BENJAMINS PUBLISHING',
       'LEIDEN UP', 'LWW', 'MERCK PUBLISHING', 'MERCURY LEARNING',
       'MERLIN PRESS', 'MULTILINGUAL MATTERS', 'NEWSOUTH BOOKS',
       'AUSTRALIA ACADEMY', 'NORTON', 'NOVA SCIENCE PUBLISHERS',
       'PARADIGM', 'PERSEUS', 'PETER LANG AG', 'PLUTO PRESS', 'SAGAMORE',
       'SAXON PUBLISHERS', 'SINAUER', 'STANFORD UP', 'THAMES & HUDSON',
       'THOROGOOD', 'TUTTLE', 'PRINCETON', 'WEST ACADEMIC', 'WOODSLANE',
       'WORLD SCIENTIFIC', 'YALE UP', 'HAWTHORNE', 'CARSON DELLOSA',
       'OUR SUNDAY VISITOR', 'LYCEUM', 'THOMSON REUTERS', 'FANTAGRAPHICS',
       'PRO-ED', 'DOVER', 'RAND MCNALLY', 'LULU', 'SAMUEL FRENCH',
       'WAVELAND', 'IMPACT', 'HARVARD UP', 'GIA', 'HAMPTON-BROWN',
       'LLEWELLYN', 'KOGAN PAGE', 'KENDALL HUNT', 'RUNNING PRESS',
       'MCFARLAND AND CO', 'FORTRESS PRESS', 'HAYNES', 'GEORGE BRAZILLER',
       'OHIO UP', 'ST PAULS', 'SPIE', 'SADLIER', 'HEBREW UP', 'LOYOLA UP',
       'SCHUMAN', 'HOLMES & MEIER', 'RIZZOLI', 'BOYDELL & BREWER',
       'PLEXUS', 'BOLCHAZY-CARDUCCI', 'INCENTIVE PUBLICATIONS',
       'QUINTESSENCE', 'NCTM', 'PENNWELL', "SAINT MARY'S PRESS",
       'CHENG & TSUI', 'PLAYERS PRESS', 'LORENZ', 'MORTON',
       'QUITE SPECIFIC', 'VENTURE PUB', 'PRAKKEN', 'NCFR', 'LOTUS',
       'PROJECT ADVENTURE', 'FEMINIST PRESS', 'ENTERPRISE', 'FERRET',
       'HAZELDEN', 'MIKE HOLT', 'WESSEX', 'BENNING', 'SOUTH WESTERN',
       'VISTA', 'HAL LEONARD CORP', 'FERNWOOD', 'FULCRUM', 'GRAYWOLF',
       'KODANSHA', 'POTOMAC', 'FREE SPIRIT', 'GLEIM', 'GINGKO',
       'OAK KNOLL', 'SAINT AUGUSTINE PRESS', 'LABYRINTH', 'TOWNSEND',
       'ENCYCLOPEDIA BRITANNICA', 'SLOAN', 'FOUNTAINHEAD', 'MANGAN COMM',
       'HARTMAN', 'AM HEART', 'MANNING', 'MICROCOSM', 'EQUINOX', 'GARNET',
       'PEEPAL TREE', 'LIVE OAK', 'APEX', 'GLAGOSLAV', 'ROTHSTEIN',
       'LITMUS', 'HERCHER', 'MCGILL UP', 'ALPHABET', 'LAROUSSE',
       'DE GREYTER', 'CAMDEN', 'NO PUBLISHER'], dtype=object)

In [26]:
#We merge our supplier table with the publisher dictionary
sup_list2 = pd.merge(sup_list, df, how='left', left_on = 'Publisher', right_on = 'PublisherLong' )

In [27]:
sup_list2

,ISBN,Supplier,Publisher,Currency,Discount,UnitShippingCost,MaxQtyPerOrder,price,PublisherLong,PublisherShort
0,9780262530873,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,UNIVERSITY PRESS
1,9780262530989,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,UNIVERSITY PRESS
2,9781760110185,ZOOKAL,ALIEN & UNWIN,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,ALIEN & UNWIN
3,9780262531092,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,UNIVERSITY PRESS
4,9780262531238,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,UNIVERSITY PRESS
...,...,...,...,...,...,...,...,...,...,...
3390617,9781936140589,ALEK,CHARLESBRIDGE,USD,0.66,0.50,100,7.95,NaN,NaN
3390618,9781936140596,ALEK,CHARLESBRIDGE,USD,0.66,0.50,100,7.95,NaN,NaN
3390619,9781936140619,ALEK,CHARLESBRIDGE,USD,0.66,0.50,100,12.95,NaN,NaN
3390620,9781936140664,ALEK,CHARLESBRIDGE,USD,0.66,0.50,100,12.99,NaN,NaN
3390621,9781936140695,ALEK,CHARLESBRIDGE,USD,0.66,0.50,100,12.95,NaN,NaN

In [28]:
sup_list2.drop(columns = ['PublisherLong'], inplace = True)

In [29]:
print('# of pubs in PublishertShort Column: ', len(sup_list2['PublisherShort'].unique()))
print('# of pubs in Publisher Column: ', len(sup_list2['Publisher'].unique()))

# of pubs in PublishertShort Column:  353
# of pubs in Publisher Column:  1546

In [30]:
sup_list2.head()

,ISBN,Supplier,Publisher,Currency,Discount,UnitShippingCost,MaxQtyPerOrder,price,PublisherShort
0,9780262530873,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS
1,9780262530989,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS
2,9781760110185,ZOOKAL,ALIEN & UNWIN,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN
3,9780262531092,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS
4,9780262531238,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS

In [31]:
sup_list2.dtypes

ISBN                 object
Supplier             object
Publisher            object
Currency             object
Discount            float64
UnitShippingCost    float64
MaxQtyPerOrder        int64
price               float64
PublisherShort       object
dtype: object

In [32]:
print('PublisherShort Empty Cells: ',sup_list2['PublisherShort'].isna().sum())
print('Publisher Empty Cells:', sup_list2['Publisher'].isna().sum())

PublisherShort Empty Cells:  123361
Publisher Empty Cells: 0

In [33]:
#Fill Na in the PusblisherShort Column
sup_list2['Pub_noNA'] = np.where(sup_list2['PublisherShort'].isna(), sup_list2['Publisher'],sup_list2['PublisherShort'])

In [34]:
sup_list2['Pub_noNA'].isna().sum()

0

In [35]:
sup_list2['Pub_noNA'].unique()

array(['UNIVERSITY PRESS', 'ALIEN & UNWIN', 'BLOOMSBURY', ...,
       'BLOODAXE BOOKS', 'BLOODAXE BOOKS LTD', 'BOOKS ON TAPE'],
      dtype=object)

In [36]:
# We need to add Supplier extra costs conditions and clean the Publisher Name
sup_list2['Invoice_Fee'] = np.where(
    sup_list2['Supplier'].str.contains('ALEK'), 0.005,
    np.where(
        (sup_list2['Supplier'].str.contains('LAURENTIU')) | (sup_list2['Supplier'].str.contains('SENAD')),0.02,
        np.where(
        (sup_list2['Supplier'].str.contains('ARMANDO')) | (sup_list2['Supplier'].str.contains('FELIPE')),1,
        0)
        )
        )

In [37]:
sup_list2.head()

,ISBN,Supplier,Publisher,Currency,Discount,UnitShippingCost,MaxQtyPerOrder,price,PublisherShort,Pub_noNA,Invoice_Fee
0,9780262530873,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0
1,9780262530989,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0
2,9781760110185,ZOOKAL,ALIEN & UNWIN,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,ALIEN & UNWIN,0.0
3,9780262531092,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0
4,9780262531238,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0

In [38]:
sup_list2['lp_Fee'] = np.where(
    (sup_list2['Supplier'].str.contains('BILLSON') & (sup_list2['Discount'] == 0 )), 0.03,0)

In [39]:
sup_list2.head()

,ISBN,Supplier,Publisher,Currency,Discount,UnitShippingCost,MaxQtyPerOrder,price,PublisherShort,Pub_noNA,Invoice_Fee,lp_Fee
0,9780262530873,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0,0.0
1,9780262530989,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0,0.0
2,9781760110185,ZOOKAL,ALIEN & UNWIN,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,ALIEN & UNWIN,0.0,0.0
3,9780262531092,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0,0.0
4,9780262531238,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0,0.0

In [40]:
#change headers
sup_list2.columns = map(str.lower, sup_list2.columns)

In [41]:
sup_list2.head()

,isbn,supplier,publisher,currency,discount,unitshippingcost,maxqtyperorder,price,publishershort,pub_nona,invoice_fee,lp_fee
0,9780262530873,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0,0.0
1,9780262530989,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0,0.0
2,9781760110185,ZOOKAL,ALIEN & UNWIN,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,ALIEN & UNWIN,0.0,0.0
3,9780262531092,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0,0.0
4,9780262531238,BILLSON,UNIVERSITY PRESS,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,UNIVERSITY PRESS,0.0,0.0

In [42]:
#Drop uneccesary columns
sup_list2.drop(columns = ['publisher', 'publishershort'], inplace = True)

In [43]:
sup_list2.head()

,isbn,supplier,currency,discount,unitshippingcost,maxqtyperorder,price,pub_nona,invoice_fee,lp_fee
0,9780262530873,BILLSON,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,0.0,0.0
1,9780262530989,BILLSON,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,0.0,0.0
2,9781760110185,ZOOKAL,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,0.0,0.0
3,9780262531092,BILLSON,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,0.0,0.0
4,9780262531238,BILLSON,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,0.0,0.0

In [44]:
#rename header
sup_list2.rename(columns={'pub_nona': 'pub'}, inplace = True)
sup_list2.head()

,isbn,supplier,currency,discount,unitshippingcost,maxqtyperorder,price,pub,invoice_fee,lp_fee
0,9780262530873,BILLSON,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,0.0,0.0
1,9780262530989,BILLSON,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,0.0,0.0
2,9781760110185,ZOOKAL,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,0.0,0.0
3,9780262531092,BILLSON,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,0.0,0.0
4,9780262531238,BILLSON,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,0.0,0.0

In [45]:
sup_list2['inv_price_before_exc'] = sup_list2['price'] * (
    1 - sup_list2['discount'] + sup_list2['lp_fee'])*(
    1 + sup_list2['invoice_fee'])

In [46]:
sup_list2.head()

,isbn,supplier,currency,discount,unitshippingcost,maxqtyperorder,price,pub,invoice_fee,lp_fee,inv_price_before_exc
0,9780262530873,BILLSON,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,0.0,0.0,3.0938
1,9780262530989,BILLSON,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,0.0,0.0,15.5000
2,9781760110185,ZOOKAL,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,0.0,0.0,13.0000
3,9780262531092,BILLSON,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,0.0,0.0,23.5290
4,9780262531238,BILLSON,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,0.0,0.0,17.3600

In [47]:
#We add the Exchange rate column
exchange_rate = """
SELECT *
FROM dbo.XChange
"""

In [48]:
exch_df = df = pd.read_sql(exchange_rate,proc_db)

In [49]:
exch_df

    id name      rate               updatedon
0    2  AUD  0.652445 2020-04-29 08:00:00.643
1    3  NZD  0.609321 2020-04-29 08:00:00.643
2    4  GBP  1.243139 2020-04-29 08:00:00.643
3    5  CAD  0.717551 2020-04-29 08:00:00.643
4    6  EUR  1.087025 2020-04-29 08:00:00.643
5    8  SGD  0.707359 2020-04-29 08:00:00.643
6    9  HKD  0.129025 2020-04-29 08:00:00.643
7    1  USD  1.000000 2020-04-29 08:00:00.643
8   10  TWD  0.033135 2020-04-29 08:00:00.643
9   11  CHF  1.022320 2020-04-29 08:00:00.643
10  12  CNY  0.143433 2020-04-29 08:00:00.643
11  13  PLN  0.255751 2020-04-29 08:00:00.643

In [50]:
#check that there is no empy space 
sup_list2.isna().sum()

isbn                    0
supplier                0
currency                0
discount                0
unitshippingcost        0
maxqtyperorder          0
price                   0
pub                     0
invoice_fee             0
lp_fee                  0
inv_price_before_exc    0
dtype: int64

In [51]:
# We merge the exchange rate
sup_list3 = pd.merge(sup_list2, exch_df, how='left', left_on = 'currency', right_on = 'name' )

In [52]:
sup_list3.head()

,isbn,supplier,currency,discount,unitshippingcost,maxqtyperorder,price,pub,invoice_fee,lp_fee,inv_price_before_exc,id,name,rate,updatedon
0,9780262530873,BILLSON,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,0.0,0.0,3.0938,4,GBP,1.243139,2020-04-29 08:00:00.643
1,9780262530989,BILLSON,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,0.0,0.0,15.5000,4,GBP,1.243139,2020-04-29 08:00:00.643
2,9781760110185,ZOOKAL,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,0.0,0.0,13.0000,2,AUD,0.652445,2020-04-29 08:00:00.643
3,9780262531092,BILLSON,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,0.0,0.0,23.5290,4,GBP,1.243139,2020-04-29 08:00:00.643
4,9780262531238,BILLSON,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,0.0,0.0,17.3600,4,GBP,1.243139,2020-04-29 08:00:00.643

In [53]:
#drop uneccesary columns that were added after the merge
sup_list3.drop(columns = ['id', 'name', 'updatedon'], inplace = True)

In [54]:
sup_list3.head()

,isbn,supplier,currency,discount,unitshippingcost,maxqtyperorder,price,pub,invoice_fee,lp_fee,inv_price_before_exc,rate
0,9780262530873,BILLSON,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,0.0,0.0,3.0938,1.243139
1,9780262530989,BILLSON,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,0.0,0.0,15.5000,1.243139
2,9781760110185,ZOOKAL,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,0.0,0.0,13.0000,0.652445
3,9780262531092,BILLSON,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,0.0,0.0,23.5290,1.243139
4,9780262531238,BILLSON,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,0.0,0.0,17.3600,1.243139

In [55]:
sup_list3['landed_cost'] = sup_list3['inv_price_before_exc'] * sup_list3['rate'] + sup_list3['unitshippingcost']

In [56]:
sup_list3.head()

,isbn,supplier,currency,discount,unitshippingcost,maxqtyperorder,price,pub,invoice_fee,lp_fee,inv_price_before_exc,rate,landed_cost
0,9780262530873,BILLSON,GBP,0.38,3.47,1000,4.99,UNIVERSITY PRESS,0.0,0.0,3.0938,1.243139,7.316025
1,9780262530989,BILLSON,GBP,0.38,3.47,1000,25.00,UNIVERSITY PRESS,0.0,0.0,15.5000,1.243139,22.738660
2,9781760110185,ZOOKAL,AUD,0.00,3.30,150,13.00,ALIEN & UNWIN,0.0,0.0,13.0000,0.652445,11.781791
3,9780262531092,BILLSON,GBP,0.38,3.47,1000,37.95,UNIVERSITY PRESS,0.0,0.0,23.5290,1.243139,32.719827
4,9780262531238,BILLSON,GBP,0.38,3.47,1000,28.00,UNIVERSITY PRESS,0.0,0.0,17.3600,1.243139,25.050900

In [57]:
sup_bestcost = sup_list3[['isbn', 'supplier','pub', 'currency','rate','price', 'discount','invoice_fee','lp_fee','inv_price_before_exc','unitshippingcost', 'landed_cost', 'maxqtyperorder']].sort_values(by='landed_cost', ascending=True)

In [58]:
sup_bestcost

,isbn,supplier,pub,currency,rate,price,discount,invoice_fee,lp_fee,inv_price_before_exc,unitshippingcost,landed_cost,maxqtyperorder
1700572,9781260241044,ALEK,MCGRAW,GBP,1.243139,-1.01,0.47,0.005,0.0,-0.537976,0.50,-0.168780,100
1700565,9781260241020,ALEK,MCGRAW,GBP,1.243139,-1.01,0.47,0.005,0.0,-0.537976,0.50,-0.168780,100
1978063,9781260241044,ALEK,MCGRAW,EUR,1.087025,-0.01,0.47,0.005,0.0,-0.005326,0.50,0.494210,100
1978062,9781260241020,ALEK,MCGRAW,EUR,1.087025,-0.01,0.47,0.005,0.0,-0.005326,0.50,0.494210,100
211997,9780786820771,ALEK,HACHETTE LIVE,USD,1.000000,0.01,0.59,0.005,0.0,0.004121,0.50,0.504120,100
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3293959,9780415191326,ZOOKAL,T&F,AUD,0.652445,28210.35,0.00,0.000,0.0,28210.350000,3.30,18409.015774,150
2796391,9780415440967,ZOOKAL,T&F,AUD,0.652445,28224.42,0.00,0.000,0.0,28224.420000,3.30,18418.195682,150
1286818,9780415441773,LAURENTIU,T&F,GBP,1.243139,25850.00,0.42,0.020,0.0,15292.860000,3.47,19014.626593,100
3177301,9780415178389,ZOOKAL,T&F,AUD,0.652445,34310.03,0.00,0.000,0.0,34310.030000,3.30,22388.724511,150
2805704,9780415441773,ZOOKAL,T&F,AUD,0.652445,34310.03,0.00,0.000,0.0,34310.030000,3.30,22388.724511,150

In [59]:
# lets remoove any title that do not have price
sup_bestcost.drop(sup_bestcost[sup_bestcost['price'] == 0].index, inplace = True)
sup_bestcost.rename(columns={'unitshippingcost': 'shipping cost', 'maxqtyperorder': 'max quantity'}, inplace = True)

In [60]:
sup_bestcost

,isbn,supplier,pub,currency,rate,price,discount,invoice_fee,lp_fee,inv_price_before_exc,shipping cost,landed_cost,max quantity
1700572,9781260241044,ALEK,MCGRAW,GBP,1.243139,-1.01,0.47,0.005,0.0,-0.537976,0.50,-0.168780,100
1700565,9781260241020,ALEK,MCGRAW,GBP,1.243139,-1.01,0.47,0.005,0.0,-0.537976,0.50,-0.168780,100
1978063,9781260241044,ALEK,MCGRAW,EUR,1.087025,-0.01,0.47,0.005,0.0,-0.005326,0.50,0.494210,100
1978062,9781260241020,ALEK,MCGRAW,EUR,1.087025,-0.01,0.47,0.005,0.0,-0.005326,0.50,0.494210,100
211997,9780786820771,ALEK,HACHETTE LIVE,USD,1.000000,0.01,0.59,0.005,0.0,0.004121,0.50,0.504120,100
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3293959,9780415191326,ZOOKAL,T&F,AUD,0.652445,28210.35,0.00,0.000,0.0,28210.350000,3.30,18409.015774,150
2796391,9780415440967,ZOOKAL,T&F,AUD,0.652445,28224.42,0.00,0.000,0.0,28224.420000,3.30,18418.195682,150
1286818,9780415441773,LAURENTIU,T&F,GBP,1.243139,25850.00,0.42,0.020,0.0,15292.860000,3.47,19014.626593,100
3177301,9780415178389,ZOOKAL,T&F,AUD,0.652445,34310.03,0.00,0.000,0.0,34310.030000,3.30,22388.724511,150
2805704,9780415441773,ZOOKAL,T&F,AUD,0.652445,34310.03,0.00,0.000,0.0,34310.030000,3.30,22388.724511,150

In [61]:
center_production = pyodbc.connect(
    'DRIVER={ODBC Driver 17 for SQL Server};'
    'Server=52.86.56.66;'
    'Database=BookXCenterProduction;'
    'UID='+sql.username+';'
    'PWD='+sql.password+';'
    'Trusted_connection=no;'
)

In [62]:
isbn_title = """
SELECT Isbn, Title, Author
FROM Isbn.Bibliography
"""

In [63]:
isbn_df = pd.read_sql(isbn_title,center_production)

In [64]:
isbn_df.dtypes

Isbn      object
Title     object
Author    object
dtype: object

In [65]:
isbn_df.isna().sum()

Isbn            0
Title     1428271
Author    1675997
dtype: int64

In [66]:
isbn_df.columns = map(str.lower, isbn_df.columns)

In [67]:
isbn_df = isbn_df.fillna('N/A')
isbn_df.isna().sum()

isbn      0
title     0
author    0
dtype: int64

In [68]:
isbn_df.head()

            isbn title author
0  9780000002402   N/A    N/A
1  9780000002679   N/A    N/A
2  9780000003102   N/A    N/A
3  9780000003201   N/A    N/A
4  9780000006493   N/A    N/A

In [69]:
isbn_col = list(isbn_df.columns).remove('isbn')

In [70]:
for col in isbn_df.columns:
    isbn_df[col] = isbn_df.apply(lambda x: clean_up(x[col]), axis =1)

In [71]:
sup_bestcost_sql = pd.merge(sup_bestcost, isbn_df, how='left', left_on = ['isbn'], right_on = ['isbn'] )

In [72]:
sup_bestcost_sql = sup_bestcost_sql[['isbn', 'title', 'author', 'pub', 'supplier','currency','rate','price','discount','invoice_fee','lp_fee','shipping cost']]
sup_bestcost_sql.head()

,isbn,title,author,pub,supplier,currency,rate,price,discount,invoice_fee,lp_fee,shipping cost
0,9781260241044,N/A,N/A,MCGRAW,ALEK,GBP,1.243139,-1.01,0.47,0.005,0.0,0.5
1,9781260241020,N/A,N/A,MCGRAW,ALEK,GBP,1.243139,-1.01,0.47,0.005,0.0,0.5
2,9781260241044,N/A,N/A,MCGRAW,ALEK,EUR,1.087025,-0.01,0.47,0.005,0.0,0.5
3,9781260241020,N/A,N/A,MCGRAW,ALEK,EUR,1.087025,-0.01,0.47,0.005,0.0,0.5
4,9780786820771,N/A,N/A,HACHETTE LIVE,ALEK,USD,1.000000,0.01,0.59,0.005,0.0,0.5

In [73]:
sup_bestcost_sql.to_csv('supplier_sql.csv',index=False)